laminar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


3
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        inGroups        1 ( empty );
        nFaces          1097600;
        startFace       1096800;
    }

    walls
    {
        type            patch;
        physicalType    patch;
        nFaces          800;
        startFace       2194400;
    }

    freestream
    {
        type            patch;
        physicalType    patch;
        nFaces          800;
        startFace       2195200;
    }

)


// ************************************************************************* //
