laminar/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    // default             cellLimited Gauss linear 1.0;
    default             Gauss linear;
}

divSchemes
{
    default             none;

    div(devRhoReff)     Gauss linear;

    div((devRhoReff&U)) Gauss linear;

    dbns
    {
        limiter         Wang;
        flux            bui;
        epsilonMin      1;
    }
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default         	corrected;
}

wallDist
{
    method              meshWave;
    nRequired           true;
}

// ************************************************************************* //

