laminar/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probes
{
    type    probes;

    libs    (sampling);

    writeControl    timeStep;

    writeInterval   1;

    fixedLocations  true;

    fields  (pMean p U);

    probeLocations
    (
        (0.00015 0 0)
        (0.000147721162951831 0.0000260472266500396 0)
        (0.000140953893117886 0.0000513030214988503 0)
        (0.000129903810567666 0.000075 0)
        (0.000114906666467847 0.0000964181414529809 0)
        (0.0000964181414529809 0.000114906666467847 0)
        (0.000075 0.000129903810567666 0)
        (0.0000513030214988503 0.000140953893117886 0)
        (0.0000260472266500396 0.000147721162951831 0)
        (0 0.00015 0)
        (-0.0000260472266500396 0.000147721162951831 0)
        (-0.0000513030214988503 0.000140953893117886 0)
        (-0.000075 0.000129903810567666 0)
        (-0.0000964181414529809 0.000114906666467847 0)
        (-0.000114906666467847 0.0000964181414529809 0)
        (-0.000129903810567666 0.000075 0)
        (-0.000140953893117886 0.0000513030214988503 0)
        (-0.000147721162951831 0.0000260472266500396 0)
        (-0.00015 0 0)
        (-0.000147721162951831 -0.0000260472266500396 0)
        (-0.000140953893117886 -0.0000513030214988503 0)
        (-0.000129903810567666 -0.000075 0)
        (-0.000114906666467847 -0.0000964181414529809 0)
        (-0.0000964181414529809 -0.000114906666467847 0)
        (-0.000075 -0.000129903810567666 0)
        (-0.0000513030214988503 -0.000140953893117886 0)
        (-0.0000260472266500396 -0.000147721162951831 0)
        (0 -0.00015 0)
        (0.0000260472266500396 -0.000147721162951831 0)
        (0.0000513030214988503 -0.000140953893117886 0)
        (0.000075 -0.000129903810567666 0)
        (0.0000964181414529809 -0.000114906666467847 0)
        (0.000114906666467847 -0.0000964181414529809 0)
        (0.000129903810567666 -0.000075 0)
        (0.000140953893117886 -0.0000513030214988503 0)
        (0.000147721162951831 -0.0000260472266500396 0)
        (0.0003 0 0)
        (0.000295442325903662 0.0000520944533000791 0)
        (0.000281907786235773 0.000102606042997701 0)
        (0.000259807621135332 0.00015 0)
        (0.000229813332935693 0.000192836282905962 0)
        (0.000192836282905962 0.000229813332935693 0)
        (0.00015 0.000259807621135332 0)
        (0.000102606042997701 0.000281907786235773 0)
        (0.0000520944533000791 0.000295442325903662 0)
        (0 0.0003 0)
        (-0.0000520944533000791 0.000295442325903662 0)
        (-0.000102606042997701 0.000281907786235773 0)
        (-0.00015 0.000259807621135332 0)
        (-0.000192836282905962 0.000229813332935693 0)
        (-0.000229813332935693 0.000192836282905962 0)
        (-0.000259807621135332 0.00015 0)
        (-0.000281907786235773 0.000102606042997701 0)
        (-0.000295442325903662 0.0000520944533000791 0)
        (-0.0003 0 0)
        (-0.000295442325903662 -0.0000520944533000791 0)
        (-0.000281907786235773 -0.000102606042997701 0)
        (-0.000259807621135332 -0.00015 0)
        (-0.000229813332935693 -0.000192836282905962 0)
        (-0.000192836282905962 -0.000229813332935693 0)
        (-0.00015 -0.000259807621135332 0)
        (-0.000102606042997701 -0.000281907786235773 0)
        (-0.0000520944533000791 -0.000295442325903662 0)
        (0 -0.0003 0)
        (0.0000520944533000791 -0.000295442325903662 0)
        (0.000102606042997701 -0.000281907786235773 0)
        (0.00015 -0.000259807621135332 0)
        (0.000192836282905962 -0.000229813332935693 0)
        (0.000229813332935693 -0.000192836282905962 0)
        (0.000259807621135332 -0.00015 0)
        (0.000281907786235773 -0.000102606042997701 0)
        (0.000295442325903662 -0.0000520944533000791 0)
        (0.00045 0 0)
        (0.000443163488855494 0.0000781416799501187 0)
        (0.000422861679353659 0.000153909064496551 0)
        (0.000389711431702997 0.000225 0)
        (0.00034471999940354 0.000289254424358943 0)
        (0.000289254424358943 0.00034471999940354 0)
        (0.000225 0.000389711431702997 0)
        (0.000153909064496551 0.000422861679353659 0)
        (0.0000781416799501187 0.000443163488855494 0)
        (0 0.00045 0)
        (-0.0000781416799501187 0.000443163488855494 0)
        (-0.000153909064496551 0.000422861679353659 0)
        (-0.000225 0.000389711431702997 0)
        (-0.000289254424358943 0.00034471999940354 0)
        (-0.00034471999940354 0.000289254424358943 0)
        (-0.000389711431702997 0.000225 0)
        (-0.000422861679353659 0.000153909064496551 0)
        (-0.000443163488855494 0.0000781416799501187 0)
        (-0.00045 0 0)
        (-0.000443163488855494 -0.0000781416799501187 0)
        (-0.000422861679353659 -0.000153909064496551 0)
        (-0.000389711431702997 -0.000225 0)
        (-0.00034471999940354 -0.000289254424358943 0)
        (-0.000289254424358943 -0.00034471999940354 0)
        (-0.000225 -0.000389711431702997 0)
        (-0.000153909064496551 -0.000422861679353659 0)
        (-0.0000781416799501187 -0.000443163488855494 0)
        (0 -0.00045 0)
        (0.0000781416799501187 -0.000443163488855494 0)
        (0.000153909064496551 -0.000422861679353659 0)
        (0.000225 -0.000389711431702997 0)
        (0.000289254424358943 -0.00034471999940354 0)
        (0.00034471999940354 -0.000289254424358943 0)
        (0.000389711431702997 -0.000225 0)
        (0.000422861679353659 -0.000153909064496551 0)
        (0.000443163488855494 -0.0000781416799501187 0)
        (0.0006 0 0)
        (0.000590884651807325 0.000104188906600158 0)
        (0.000563815572471545 0.000205212085995401 0)
        (0.000519615242270663 0.0003 0)
        (0.000459626665871387 0.000385672565811924 0)
        (0.000385672565811924 0.000459626665871387 0)
        (0.0003 0.000519615242270663 0)
        (0.000205212085995401 0.000563815572471545 0)
        (0.000104188906600158 0.000590884651807325 0)
        (0 0.0006 0)
        (-0.000104188906600158 0.000590884651807325 0)
        (-0.000205212085995401 0.000563815572471545 0)
        (-0.0003 0.000519615242270663 0)
        (-0.000385672565811924 0.000459626665871387 0)
        (-0.000459626665871387 0.000385672565811924 0)
        (-0.000519615242270663 0.0003 0)
        (-0.000563815572471545 0.000205212085995401 0)
        (-0.000590884651807325 0.000104188906600158 0)
        (-0.0006 0 0)
        (-0.000590884651807325 -0.000104188906600158 0)
        (-0.000563815572471545 -0.000205212085995401 0)
        (-0.000519615242270663 -0.0003 0)
        (-0.000459626665871387 -0.000385672565811924 0)
        (-0.000385672565811924 -0.000459626665871387 0)
        (-0.0003 -0.000519615242270663 0)
        (-0.000205212085995401 -0.000563815572471545 0)
        (-0.000104188906600158 -0.000590884651807325 0)
        (0 -0.0006 0)
        (0.000104188906600158 -0.000590884651807325 0)
        (0.000205212085995401 -0.000563815572471545 0)
        (0.0003 -0.000519615242270663 0)
        (0.000385672565811924 -0.000459626665871387 0)
        (0.000459626665871387 -0.000385672565811924 0)
        (0.000519615242270663 -0.0003 0)
        (0.000563815572471545 -0.000205212085995401 0)
        (0.000590884651807325 -0.000104188906600158 0)
        (0.00075 0 0)
        (0.000738605814759156 0.000130236133250198 0)
        (0.000704769465589431 0.000256515107494252 0)
        (0.000649519052838329 0.000375 0)
        (0.000574533332339234 0.000482090707264904 0)
        (0.000482090707264904 0.000574533332339234 0)
        (0.000375 0.000649519052838329 0)
        (0.000256515107494252 0.000704769465589431 0)
        (0.000130236133250198 0.000738605814759156 0)
        (0 0.00075 0)
        (-0.000130236133250198 0.000738605814759156 0)
        (-0.000256515107494252 0.000704769465589431 0)
        (-0.000375 0.000649519052838329 0)
        (-0.000482090707264904 0.000574533332339234 0)
        (-0.000574533332339234 0.000482090707264904 0)
        (-0.000649519052838329 0.000375 0)
        (-0.000704769465589431 0.000256515107494252 0)
        (-0.000738605814759156 0.000130236133250198 0)
        (-0.00075 0 0)
        (-0.000738605814759156 -0.000130236133250198 0)
        (-0.000704769465589431 -0.000256515107494252 0)
        (-0.000649519052838329 -0.000375 0)
        (-0.000574533332339234 -0.000482090707264904 0)
        (-0.000482090707264904 -0.000574533332339234 0)
        (-0.000375 -0.000649519052838329 0)
        (-0.000256515107494252 -0.000704769465589431 0)
        (-0.000130236133250198 -0.000738605814759156 0)
        (0 -0.00075 0)
        (0.000130236133250198 -0.000738605814759156 0)
        (0.000256515107494252 -0.000704769465589431 0)
        (0.000375 -0.000649519052838329 0)
        (0.000482090707264904 -0.000574533332339234 0)
        (0.000574533332339234 -0.000482090707264904 0)
        (0.000649519052838329 -0.000375 0)
        (0.000704769465589431 -0.000256515107494252 0)
        (0.000738605814759156 -0.000130236133250198 0)
        (0.0009 0 0)
        (0.000886326977710987 0.000156283359900237 0)
        (0.000845723358707318 0.000307818128993102 0)
        (0.000779422863405995 0.00045 0)
        (0.00068943999880708 0.000578508848717885 0)
        (0.000578508848717885 0.00068943999880708 0)
        (0.00045 0.000779422863405995 0)
        (0.000307818128993102 0.000845723358707318 0)
        (0.000156283359900237 0.000886326977710987 0)
        (0 0.0009 0)
        (-0.000156283359900237 0.000886326977710987 0)
        (-0.000307818128993102 0.000845723358707318 0)
        (-0.00045 0.000779422863405995 0)
        (-0.000578508848717885 0.00068943999880708 0)
        (-0.00068943999880708 0.000578508848717885 0)
        (-0.000779422863405995 0.00045 0)
        (-0.000845723358707318 0.000307818128993102 0)
        (-0.000886326977710987 0.000156283359900237 0)
        (-0.0009 0 0)
        (-0.000886326977710987 -0.000156283359900237 0)
        (-0.000845723358707318 -0.000307818128993102 0)
        (-0.000779422863405995 -0.00045 0)
        (-0.00068943999880708 -0.000578508848717885 0)
        (-0.000578508848717885 -0.00068943999880708 0)
        (-0.00045 -0.000779422863405995 0)
        (-0.000307818128993102 -0.000845723358707318 0)
        (-0.000156283359900237 -0.000886326977710987 0)
        (0 -0.0009 0)
        (0.000156283359900237 -0.000886326977710987 0)
        (0.000307818128993102 -0.000845723358707318 0)
        (0.00045 -0.000779422863405995 0)
        (0.000578508848717885 -0.00068943999880708 0)
        (0.00068943999880708 -0.000578508848717885 0)
        (0.000779422863405995 -0.00045 0)
        (0.000845723358707318 -0.000307818128993102 0)
        (0.000886326977710987 -0.000156283359900237 0)
        (0.00105 0 0)
        (0.00103404814066282 0.000182330586550277 0)
        (0.000986677251825204 0.000359121150491952 0)
        (0.000909326673973661 0.000525 0)
        (0.000804346665274927 0.000674926990170866 0)
        (0.000674926990170866 0.000804346665274927 0)
        (0.000525 0.000909326673973661 0)
        (0.000359121150491952 0.000986677251825204 0)
        (0.000182330586550277 0.00103404814066282 0)
        (0 0.00105 0)
        (-0.000182330586550277 0.00103404814066282 0)
        (-0.000359121150491952 0.000986677251825204 0)
        (-0.000525 0.000909326673973661 0)
        (-0.000674926990170866 0.000804346665274927 0)
        (-0.000804346665274927 0.000674926990170866 0)
        (-0.000909326673973661 0.000525 0)
        (-0.000986677251825204 0.000359121150491952 0)
        (-0.00103404814066282 0.000182330586550277 0)
        (-0.00105 0 0)
        (-0.00103404814066282 -0.000182330586550277 0)
        (-0.000986677251825204 -0.000359121150491952 0)
        (-0.000909326673973661 -0.000525 0)
        (-0.000804346665274927 -0.000674926990170866 0)
        (-0.000674926990170866 -0.000804346665274927 0)
        (-0.000525 -0.000909326673973661 0)
        (-0.000359121150491952 -0.000986677251825204 0)
        (-0.000182330586550277 -0.00103404814066282 0)
        (0 -0.00105 0)
        (0.000182330586550277 -0.00103404814066282 0)
        (0.000359121150491952 -0.000986677251825204 0)
        (0.000525 -0.000909326673973661 0)
        (0.000674926990170866 -0.000804346665274927 0)
        (0.000804346665274927 -0.000674926990170866 0)
        (0.000909326673973661 -0.000525 0)
        (0.000986677251825204 -0.000359121150491952 0)
        (0.00103404814066282 -0.000182330586550277 0)
    );
}

// ************************************************************************* //
